var decks = [
  {
    id: "0",
    title: "THE FOOL",
    des: "ช่วงนี้คุณอยากปลดปล่อย ทำอะไรตามใจตัวเอง มีอิสรเสรี ปล่อยวางสิ่งต่างๆ และทำอะไรตามใจตัวเอง ไม่คิดอะไรมากและทำสิ่งที่ตัวเองอยากทำอย่างเต็มที่",
    photo: "the-fool",
  },
  {
    id: "1",
    title: "THE MAGICIAN",
    des: "ทำสิ่งต่างๆ ด้วยสติปัญญา ทำสิ่งใดก็จะสำเร็จลุล่วง ปัญหาจะคลี่คลายด้วยสติปัญญาของตนเอง นอกจากนี้ยังได้รับการเกื้อหนุนจากสิ่งศักดิ์สิทธิ์ เรียกได้ว่ามีความสามารถและฟ้าก็เป็นใจ ชีวิตรุ่งเรืองอย่างเต็มที่",
    photo: "the-magician",
  },
  {
    id: "2",
    title: "THE HIGH PRIESTESS",
    des: "ความน่ารัก ความเยาว์วัย ความไร้เดียงสาที่ทำให้โลกเต็มไปด้วยความสดใสน่ารัก ความใสซื่อบริสุทธิ์ที่ต้องรักษาทำให้ต้องปิดบัง ซ่อนเร้น ความลับที่ไม่ดีไม่งามเอาไว้",
    photo: "the-high-priestess",
  },
  {
    id: "3",
    title: "THE EMPRESS",
    des: "ความรักคือการให้การปกป้องคุ้มครอง มีความปรารถนาดีให้แก่ผู้คนรอบตัว มีความสุขสมบูรณ์พูนพร้อมไปด้วยสิ่งต่างๆ\nโดยไม่คิดแสวงหาสิ่งใดและเป็นผู้ให้อย่างแท้จริง",
    photo: "the-empress",
  },
  {
    id: "4",
    title: "THE EMPEROR",
    des: "เต็มเปี่ยมไปด้วยอำนาจทรงพลัง จัดการทุกอย่างอย่างเบ็ดเสร็จมีความเผด็จการแต่ก็มีความสามารถที่จะแก้ไขปัญหาและเป็นผู้นำไปสู่ความสำเร็จเป็นผู้นำที่น่านับถือและนำพาให้ผู้อื่นและตนเองไปสู่ความสำเร็จรุ่งเรือง",
    photo: "the-emperor",
  },
  {
    id: "5",
    title: "THE HIEROPHANT",
    des: "ทำทุกอย่างด้วยความถูกต้องถูกศิลธรรมและแบบแผนประเพณี ถึงแม้ว่าการกระทำนั้นจะไม่ถูกใจก็ตามสิ่งนี้ทำให้เกิดความสบายใจและป้องกันตนเองจากอุปสรรค์และปัญหาที่กำลังจะตามมาจากการทำผิดศิลธรรมและความถูกต้อง ",
    photo: "the-hierophant",
  },
  {
    id: "6",
    title: "THE LOVERS",
    des: "ความรักที่สวยงามกำลังรุมเร้าความรักได้ก่อเกิดขึ้นภายในใจเกิดความกระวนกระวาย อยากได้เป็นเจ้าของ อยากได้รับความรักนั้นจนทำตัวไม่ถูกความตั้งสติและสุภาพต่อความรักที่กำลังเกิดขึ้นแล้วทุกอย่างจะสวยงาม",
    photo: "the-lovers",
  },
  {
    id: "7",
    title: "THE CHARIOT",
    des: "การฝ่าฟันอุปสรรค์การแข่งขัน การตัดสินใจที่จะต่อสู้ด้วยทุกสิ่งทุกอย่างที่มีด้วยความกล้าหาญสติปัญญาและความสามารถ ทำให้การตัดสินใจนี้เป็นจุดเริ่มต้นของชัยชนะที่รออยู่ข้างหน้า ",
    photo: "the-chariot",
  },
  {
    id: "8",
    title: "THE STRENGTH",
    des: "กำลังใจที่เข้มแข็งจะทำให้เราชนะได้ในทุกอุปสรรคเอาชนะความก้าวร้าวด้วยความนิ่งสงบและสุภาพความเข้มแข็งที่แท้จริงไม่ใช่พละกำลังแต่เป็นจิตใจที่ไม่หวั่นไหวมั่นคงและเข้มแข็ง",
    photo: "the-strength",
  },
  {
    id: "9",
    title: "THE HERMIT",
    des: "ทำความเข้าใจตัวตนโดยการให้เวลากับตัวเองให้มากปลีกวิเวก สงบ แสวงหาความสุขด้วยการอยู่กับตัวเอง ใช้ความสงบเงียบพัฒนาวาระแห่งจิตเพิ่มกำลังสติปัญญา สามารถมีความสุขได้ด้วยความสงบโดยลำพัง",
    photo: "the-hermit",
  },
  {
    id: "10",
    title: "WHEEL OF FORTUNE",
    des: "วงล้อแห่งโชคชะตากำลังหมุนไป ชีวิตกำลังเคลื่อนไหวเปลี่ยนแปลงไปตามผลของการกระทำอาจจะเป็นทางดีก็ได้ ร้ายก็ได้ แต่การเปลี่ยนแปลงกำลังมาถึงอย่างแน่นอน",
    photo: "wheel-of-fortune",
  },
  {
    id: "11",
    title: "JUSTICE",
    des: "มีความยุติธรรม ใช้เหตุผลมากกว่าอารมณ์ เอาชนะอคติภายในใจ มีความเด็ดขาด ดำเนินชีวิตไปด้วยความถูกต้องและถูกกฎหมาย ถูกหลักการ",
    photo: "justice",
  },
  {
    id: "12",
    title: "THE HANGED MAN",
    des: "ตกอยู่ในที่นั่งลำบาก กลืนไม่เข้าคายไม่ออก อึดอัดคับใจแต่ก็ไม่สามารถเปลี่ยนแปลงอะไรได้ ต้องอดทนไปก่อน อาจจะมองเห็นสิ่งใหม่ๆ มุมมองใหม่ๆ จากสถานภาพที่เป็นอยู่",
    photo: "the-hanged-man",
  },
  {
    id: "13",
    title: "DEATH",
    des: "เวลาแห่งการสิ้นสุดมาถึงแล้วยากที่จะหลีกเลี่ยงได้ แต่ถึงบางสิ่งจะสิ้นสุดลงไปบางสิ่งก็จะเจริญงอกงามและกำเนิดขึ้นมาแทน สิ่งเก่าไปสิ่งใหม่เข้ามา",
    photo: "death",
  },
  {
    id: "14",
    title: "TEMPRANCE",
    des: "ปรับตัวและควบคุมสิ่งต่างๆ ความรู้สึก อารมณ์ ชีวิตที่พุ่งพล่าน วุ่นวาย สับสัน ถ่ายเท หมุนวนเปลี่ยนแปลงให้สงบอย่างมีสติ เกิดปัญญา เกิดความรู้ มีความสุข มีความเข้าใจในตนเอง โลก และชีวิต",
    photo: "temprance",
  },
  {
    id: "15",
    title: "THE DEVIL",
    des: "กิเลสตัณหาเหมือนปีศาจภายในใจ เหมือนไฟที่ร้อนรุ่มสุมอก ทุกทรมานเพราะความอยากได้ อยากมี ความโลภที่ไม่สิ้นสุดเป็นแรงผลักดันของชีวิต การเสพย์สุข การเสพย์กามอย่างไม่สิ้นสุดทำให้ชีวิตไม่สงบสุข",
    photo: "the-devil",
  },
  {
    id: "16",
    title: "THE TOWER",
    des: "การพังทลาย การสูญเสียอย่างไม่ทันตั้งตัว ฉับพลัน เด็ดขาดและย่อยยับ เป็นอุบัติเหตุ เป็นภัยพิบัติ เป็นโชคร้ายที่คาดไม่ถึงมาก่อน",
    photo: "the-tower",
  },
  {
    id: "17",
    title: "THE STAR",
    des: "ดวงดาวเป็นตัวแทนแห่งความหวัง ความหวังเป็นสิ่งที่ช่วยเยียวยาจิตใจเพิ่มพลังชีวิตและชี้นำหนทางให้กับผู้เดินทางที่เหนื่อยล้าได้ลุกขึ้นมาดำเนินชีวิตและเดินทางไปในทางที่ถูกต้อง",
    photo: "the-star",
  },
  {
    id: "18",
    title: "THE MOON.",
    des: "พระจันทร์กระจ่างฟ้าในคืนเดือนมืดทำให้ดวงดาวนำทางหายไป แม้แสงจันทร์สว่างแต่ก็ไร้แสงดาวนำทางความกลัว ความสับสนจึงเอ่อล้น เหมือนน้ำขึ้นในคืนพระจันทร์เต็มดวง ระวังใจให้ดี",
    photo: "the-moon",
  },
  {
    id: "19",
    title: "THE SUN.",
    des: "พระอาทิตย์คือพลังและชีวิต แสงอาทิตย์คือความสว่างสดใส สิ่งที่ซ่อนเร้นปิดบังไว้ถูกปัดเป่า เต็มเปี่ยมไปด้วยชีวิตชีวา เต็มเปี่ยมไปด้วยพลัง ชีวิตดำเนินไปด้วยความสุข",
    photo: "the-sun",
  },
  {
    id: "20",
    title: "THE WORLD.",
    des: "โลกมีสิ่งที่เราต้องการมากมาย มีสิ่งต่างๆ ให้เราเลือกหยิบเลือกใช้ได้ตามที่ใจต้องการและเราก็ไขว่คว้ามันได้อย่างที่ใจปรารถนา เติมเต็มชีวิตได้อย่างสมบูรณ์",
    photo: "the-world",
  },
];

//คลิกแล้วจะหมุนการ์ด
$(document).ready(function () {
  $(".myBtn").on("click", function (event) {
    event.preventDefault();
    $(".main-card").toggleClass("is-flipped").delay(100).queue(letgo);
    return false;
  });
});

//ฟั่งชั่นการสุ่มการ์ด,แสดงผล และบันทึกค่า
function letgo() {
  var cardurl = 'https://malipublishing.com/tarot/' // url ของเว็บแชร์การ์ด
  const $title = document.querySelector("#title"),
    $sub = document.querySelector("#sub");

  let checknum = readCookie('num');
  if (checknum === null) {
    var random_num = Math.floor(Math.random() * 20); //หากเพิ่มหรือลบ การ์ด ให้เปลี่ยนเลขที่สุ่มด้วย
  }
  else {
    var random_num = readCookie('num');
  }
  let display_text = true;
  if (display_text) {
    createCookie('num', random_num, 1)
    $title.innerHTML = decks[random_num].title; //ชื่อการ์ด
    $sub.innerHTML = decks[random_num].des; //คำอธิบายการ์ด
    document.getElementById('share').innerHTML
    document.getElementById('pic').src = 'images/' + decks[random_num].photo + '.png'; //src='ที่อยู่ของไฟล์การ์ด'และชื่อรูปแต่ละการ์ด
  }
  display_text = !display_text;
}


//สร้าง cookie ในการเปิดการ์ด 1ใบ/1วัน
function createCookie(name,value,days) {
	if (days) {
		var date = new Date();
    var midnight = new Date(date.getFullYear(), date.getMonth(), date.getDate(), 23, 59, 59);
		var expires = "; expires="+midnight.toGMTString();
	}
	else var expires = "";
	document.cookie = name+"="+value+expires+"; path=/";
}


//อ่านค่าที่บันทึกไว้
function readCookie(name) {
  var nameEQ = name + "=";
  var ca = document.cookie.split(';');
  for (var i = 0; i < ca.length; i++) {
    var c = ca[i];
    while (c.charAt(0) == ' ') c = c.substring(1, c.length);
    if (c.indexOf(nameEQ) == 0) return c.substring(nameEQ.length, c.length);
  }
  return null;
}
//ลบค่าของ cookie
function eraseCookie(name) {
  createCookie(name, "", -1);
}